// Lab_03_3.cpp
// < Стефурак Анна >
// Лабораторна робота No 3.3
// Розгалуження, задане графіком функції.
// Варіант 14

#include <iostream>
#include <cmath> // для використання sqrt

using namespace std;

int main() {
    double x; // вхідний аргумент
    double R; // вхідний параметр
    double y; // результат обчислення виразу

    // Введення значення R
    cout << "Введіть значення R: ";
    cin >> R;

    // Введення значення x
    cout << "Введіть значення x: ";
    cin >> x;

    // розгалуження в повній формі
    if (x <= -4 * R) {
        y = -2 * R; // Ліва горизонтальна лінія
    }
    else 
        if (x > -4 * R && x <= 0) {
        y = (0.75 * x) + 1 * R; // Лінійний відрізок між -4 і 0
    }
    else 
            if (x > 0 && x <= 2 * R) {
        y = x * x; // Парабола y = x^2
    }
    else 
if (x > 2 * R && x <= 10 * R) {
        y = -0.5 * x + 5 * R; // Лінійний відрізок між 2 і 10
    }
    else {
        y = 0; // Права горизонтальна лінія для x > 10
    }

    // Виведення результату
    cout << endl;
    cout << "y = " << y << endl;

    cin.get();
    return 0;
}
